----------------------------------------------------------------------------------------------|>
--[+] Список доступных языков :--:--:--:--:--:--:--:--:--:--:--:}>                            |>
----------------------------------------------------------------------------------------------|>
Guitar_Hero.Languages = {
	["ru"] = {
		["Настройки"] = "[Настройки]",
		["Папка недоступна"] = " Пока ваша папка DATA закрыта для доступа, - сохранение настроек ",
		["невозможно"] = "невозможно",
		["Язык"] = "Язык",
		["Тема"] = "Тема",
		["Изменить"] = "Изменить",
		["Добро пожаловать"] = "Добро пожаловать",
		["Играть"] = "Играть",
		["Начать"] = "Начать",
		["Подтверждение"] = "Подтверждение",
		["секунд"] = "сек",
		["Громкость звуков"] = "Громкость звуков",
		["Загрузка музыки"] = "Загрузка музыки",
		["Мод"] = "Мод",
		["Клавиша"] = "Клавиша",
		["Белый список"] = "[Белый список] ",
		["Чёрный список"] = "[Чёрный список] ",
		["Нужно: "] = "Нужно: ",
		["Неизвестно"] = "Неизвестно."
	},
	["en"] = {
		["Настройки"] = "[Settings]",
		["Папка недоступна"] = " While your DATA folder is closed for access, save settings ",
		["невозможно"] = "impossible",
		["Язык"] = "Language",
		["Тема"] = "Theme",
		["Изменить"] = "Edit",
		["Добро пожаловать"] = "Welcome",
		["Играть"] = "Play",
		["Начать"] = "Start",
		["Подтверждение"] = "Confirmation",
		["секунд"] = "sec",
		["Громкость звуков"] = "Volume of sounds",
		["Загрузка музыки"] = "Downloading music",
		["Мод"] = "Mod",
		["Клавиша"] = "Key",
		["Белый список"] = "[The whitelist] ",
		["Чёрный список"] = "[The blacklist] ",
		["Нужно: "] = "Need: ",
		["Неизвестно"] = "Unknown."
	},
	["de"] = {
		["Настройки"] = "[Einst.]",
		["Папка недоступна"] = " Solange Ihr Datenordner für den Zugriff geschlossen ist, speichern Sie die Einstellungen ",
		["невозможно"] = "unmöglich",
		["Язык"] = "Sprache",
		["Тема"] = "Theme",
		["Изменить"] = "Ändern",
		["Добро пожаловать"] = "Willkommen",
		["Играть"] = "Spielen",
		["Начать"] = "Starten",
		["Подтверждение"] = "Die Bestätigung",
		["секунд"] = "sek",
		["Громкость звуков"] = "Lautstärke",
		["Загрузка музыки"] = "Musik herunterladen",
		["Мод"] = "Mod",
		["Клавиша"] = "Schl",
		["Белый список"] = "[Weiße Liste] ",
		["Чёрный список"] = "[Black list] ",
		["Нужно: "] = "Man muß: ",
		["Неизвестно"] = "Unbekannt."
	}
}

-->                      _M_                                                   
-- [*] Кто ты, Воин?    (0-0)                     
-->                      -w-   
--