----------------------------------------------------------------------------------------------|>
--[+] Список доступных языков :--:--:--:--:--:--:--:--:--:--:--:}>                            |>
----------------------------------------------------------------------------------------------|>
Guitar_Hero.Languages = {}
local l = Guitar_Hero.Languages

--------------------------------------------------------------------------------------------------------------|>
--[+] Russian :--:--:--:--:--:--:--:--:--:--:--:}>                                                            |>
--------------------------------------------------------------------------------------------------------------|>
l["ru"] = { -- Русский
	["Создать"] = "Создать",
	["Готово"] = "Готово",
	["Да"] = "Да",
	["Нет"] = "Нет",
	["Хочу"] = "Хочу",
	["Настройки"] = "[Настройки]",
	["Папка недоступна"] = " Пока ваша папка DATA закрыта для доступа, - сохранение настроек ",
	["невозможно"] = "невозможно",
	["Язык"] = "Язык",
	["Тема"] = "Тема",
	["Изменить"] = "Изменить",
	["Добро пожаловать"] = "Добро пожаловать",
	["Играть"] = "Играть",
	["Начать"] = "Начать",
	["Подтверждение"] = "Подтверждение",
	["секунд"] = "сек",
	["Громкость звуков"] = "Громкость звуков",
	["Загрузка музыки"] = "Загрузка музыки",
	["Мод"] = "Мод",
	["Клавиша"] = "Клавиша",
	["Белый список"] = "[Белый список] ",
	["Чёрный список"] = "[Чёрный список] ",
	["Нужно: "] = "Нужно: ",
	["Неизвестно"] = "Неизвестно.",
	["Создать новый"] = "Создать сборник",
	["Выбранный плейлист"] = "Выбранный плейлист",
	["Название плейлиста..."] = "Название плейлиста...",
	["Вы не выбрали даже одной музыки"] = "Вы не выбрали даже одной музыки.",
	["Такое название плейлиста уже есть!"] = "Такое название плейлиста уже есть!",
	["Такое название плейлиста недопусимо!"] = "Такое название плейлиста недопусимо!",
	["Вы точно хотите удалить этот плейлист?"] = "Вы точно хотите удалить этот плейлист?"

}
--------------------------------------------------------------------------------------------------------------|>
--[+] English :--:--:--:--:--:--:--:--:--:--:--:}>                                                            |>
--------------------------------------------------------------------------------------------------------------|>
l["en"] = {
	["Создать"] = "Create",
	["Готово"] = "Done",
	["Да"] = "Yes",
	["Нет"] = "No",
	["Хочу"] = "Want",
	["Настройки"] = "[Settings]",
	["Папка недоступна"] = " While your DATA folder is closed for access, save settings ",
	["невозможно"] = "impossible",
	["Язык"] = "Language",
	["Тема"] = "Theme",
	["Изменить"] = "Edit",
	["Добро пожаловать"] = "Welcome",
	["Играть"] = "Play",
	["Начать"] = "Start",
	["Подтверждение"] = "Confirmation",
	["секунд"] = "sec",
	["Громкость звуков"] = "Volume of sounds",
	["Загрузка музыки"] = "Downloading music",
	["Мод"] = "Mod",
	["Клавиша"] = "Key",
	["Белый список"] = "[The whitelist] ",
	["Чёрный список"] = "[The blacklist] ",
	["Нужно: "] = "Need: ",
	["Неизвестно"] = "Unknown.",
	["Создать новый"] = "Create New",
	["Выбранный плейлист"] = "Selected playlist",
	["Название плейлиста..."] = "Playlist name...",
	["Вы не выбрали даже одной музыки"] = "No music selected.",
	["Такое название плейлиста уже есть!"] = "This playlist name is already taken.",
	["Такое название плейлиста недопусимо!"] = "Invalid playlist name.",
	["Вы точно хотите удалить этот плейлист?"] = "Are you sure you want to delete this playlist?"
}

--------------------------------------------------------------------------------------------------------------|>
--[+] German :--:--:--:--:--:--:--:--:--:--:--:}>                                                             |>
--------------------------------------------------------------------------------------------------------------|>
l["de"] = {
	["Создать"] = "Erstellen",
	["Готово"] = "Fertig",
	["Да"] = "Ja",
	["Нет"] = "Nein",
	["Хочу"] = "Will",
	["Настройки"] = "[Einst.]",
	["Папка недоступна"] = " Solange Ihr Datenordner für den Zugriff geschlossen ist, speichern Sie die Einstellungen ",
	["невозможно"] = "unmöglich",
	["Язык"] = "Sprache",
	["Тема"] = "Theme",
	["Изменить"] = "Ändern",
	["Добро пожаловать"] = "Willkommen",
	["Играть"] = "Spielen",
	["Начать"] = "Starten",
	["Подтверждение"] = "Die Bestätigung",
	["секунд"] = "sek",
	["Громкость звуков"] = "Lautstärke",
	["Загрузка музыки"] = "Musik herunterladen",
	["Мод"] = "Mod",
	["Клавиша"] = "Schl",
	["Белый список"] = "[Weiße Liste] ",
	["Чёрный список"] = "[Black list] ",
	["Нужно: "] = "Man muß: ",
	["Неизвестно"] = "Unbekannt.",
	["Создать новый"] = "Neu erstellen",
	["Выбранный плейлист"] = "Chosen playlist",
	["Название плейлиста..."] = "Playlist-Name...",
	["Вы не выбрали даже одной музыки"] = "Es wurde keine Musik ausgewählt.",
	["Такое название плейлиста уже есть!"] = "Dieser Playlist-Name ist bereits vergeben!",
	["Такое название плейлиста недопусимо!"] = "Ungültiger Playlist-Name.",
	["Вы точно хотите удалить этот плейлист?"] = "Sind Sie sicher, dass Sie diese Playlist löschen möchten?"
}

--------------------------------------------------------------------------------------------------------------|>
--[+] Polish :--:--:--:--:--:--:--:--:--:--:--:}>                                                             |>
--------------------------------------------------------------------------------------------------------------|>
l["pl"] = {
    ["Создать"] = "Utwórz",
    ["Готово"] = "Gotowe",
    ["Да"] = "Tak",
    ["Нет"] = "Nie",
    ["Хочу"] = "Chcę",
    ["Настройки"] = "[Ustawienia]",
    ["Папка недоступна"] = " Gdy folder DATA jest zamknięty do dostępu, zapisz ustawienia ",
    ["невозможно"] = "niemożliwe",
    ["Язык"] = "Język",
    ["Тема"] = "Motyw",
    ["Изменить"] = "Edytuj",
    ["Добро пожаловать"] = "Witamy",
    ["Играть"] = "Graj",
    ["Начать"] = "Rozpocznij",
    ["Подтверждение"] = "Potwierdzenie",
    ["секунд"] = "sek",
    ["Громкость звуков"] = "Głośność dźwięków",
    ["Загрузка музыки"] = "Pobieranie muzyki",
    ["Мод"] = "Mod",
    ["Клавиша"] = "Klawisz",
    ["Белый список"] = "[Biała lista] ",
    ["Чёрный список"] = "[Czarna lista] ",
    ["Нужно: "] = "Potrzebne: ",
    ["Неизвестно"] = "Nieznane.",
    ["Создать новый"] = "Utwórz nowy",
    ["Выбранный плейлист"] = "Wybrana playlista",
    ["Название плейлиста..."] = "Nazwa playlisty...",
    ["Вы не выбрали даже одной музыки"] = "Nie wybrano muzyki.",
    ["Такое название плейлиста уже есть!"] = "Ta nazwa playlisty jest już zajęta!",
    ["Такое название плейлиста недопусимо!"] = "Nieprawidłowa nazwa playlisty.",
    ["Вы точно хотите удалить этот плейлист?"] = "Czy na pewno chcesz usunąć tę playlistę?"
}

--------------------------------------------------------------------------------------------------------------|>
--[+] Ukrainian :--:--:--:--:--:--:--:--:--:--:--:}>                                                          |>
--------------------------------------------------------------------------------------------------------------|>
l["uk"] = {
    ["Создать"] = "Створити",
    ["Готово"] = "Готово",
    ["Да"] = "Так",
    ["Нет"] = "Ні",
    ["Хочу"] = "Хочу",
    ["Настройки"] = "[Налаштування]",
    ["Папка недоступна"] = " Поки ваша папка DATA закрита для доступу, - збереження налаштувань ",
    ["невозможно"] = "неможливо",
    ["Язык"] = "Мова",
    ["Тема"] = "Тема",
    ["Изменить"] = "Змінити",
    ["Добро пожаловать"] = "Ласкаво просимо",
    ["Играть"] = "Грати",
    ["Начать"] = "Почати",
    ["Подтверждение"] = "Підтвердження",
    ["секунд"] = "сек",
    ["Громкость звуков"] = "Гучність звуків",
    ["Загрузка музыки"] = "Завантаження музики",
    ["Мод"] = "Мод",
    ["Клавиша"] = "Клавіша",
    ["Белый список"] = "[Білий список] ",
    ["Чёрный список"] = "[Чорний список] ",
    ["Нужно: "] = "Потрібно: ",
    ["Неизвестно"] = "Невідомо.",
    ["Создать новый"] = "Створити збірник",
    ["Выбранный плейлист"] = "Вибраний плейлист",
    ["Название плейлиста..."] = "Назва плейлиста...",
    ["Вы не выбрали даже одной музыки"] = "Ви не вибрали жодної музики.",
    ["Такое название плейлиста уже есть!"] = "Така назва плейлиста вже існує!",
    ["Такое название плейлиста недопусимо!"] = "Така назва плейлиста неприпустима!",
    ["Вы точно хотите удалить этот плейлист?"] = "Ви точно хочете видалити цей плейлист?"
}

--------------------------------------------------------------------------------------------------------------|>
--[+] Turkish :--:--:--:--:--:--:--:--:--:--:--:}>                                                            |>
--------------------------------------------------------------------------------------------------------------|>
l["tr"] = {
    ["Создать"] = "Oluştur",
    ["Готово"] = "Tamam",
    ["Да"] = "Evet",
    ["Нет"] = "Hayır",
    ["Хочу"] = "İstiyorum",
    ["Настройки"] = "[Ayarlar]",
    ["Папка недоступна"] = " DATA klasörünüz erişime kapalıyken, ayarları kaydetmek ",
    ["невозможно"] = "imkansız",
    ["Язык"] = "Dil",
    ["Тема"] = "Tema",
    ["Изменить"] = "Düzenle",
    ["Добро пожаловать"] = "Hoş geldiniz",
    ["Играть"] = "Oynat",
    ["Начать"] = "Başlat",
    ["Подтверждение"] = "Onay",
    ["секунд"] = "sn",
    ["Громкость звуков"] = "Ses seviyesi",
    ["Загрузка музыки"] = "Müzik indiriyor",
    ["Мод"] = "Mod",
    ["Клавиша"] = "Tuş",
    ["Белый список"] = "[Beyaz liste] ",
    ["Чёрный список"] = "[Kara liste] ",
    ["Нужно: "] = "Gerekli: ",
    ["Неизвестно"] = "Bilinmeyen.",
    ["Создать новый"] = "Yeni oluştur",
    ["Выбранный плейлист"] = "Seçilen çalma listesi",
    ["Название плейлиста..."] = "Çalma listesi adı...",
    ["Вы не выбрали даже одной музыки"] = "Müzik seçilmedi.",
    ["Такое название плейлиста уже есть!"] = "Bu çalma listesi adı zaten alınmış!",
    ["Такое название плейлиста недопусимо!"] = "Geçersiz çalma listesi adı.",
    ["Вы точно хотите удалить этот плейлист?"] = "Bu çalma listesini silmek istediğinizden emin misiniz?"
}

--------------------------------------------------------------------------------------------------------------|>
--[+] French :--:--:--:--:--:--:--:--:--:--:--:}>                                                             |>
--------------------------------------------------------------------------------------------------------------|>
l["fr"] = { 
    ["Создать"] = "Créer",
    ["Готово"] = "Terminé",
    ["Да"] = "Oui",
    ["Нет"] = "Non",
    ["Хочу"] = "Je veux",
    ["Настройки"] = "[Paramètres]",
    ["Папка недоступна"] = "Tant que votre dossier DATA est fermé, l'enregistrement des paramètres",
    ["невозможно"] = "est impossible",
    ["Язык"] = "Langue",
    ["Тема"] = "Thème",
    ["Изменить"] = "Modifier",
    ["Добро пожаловать"] = "Bienvenue",
    ["Играть"] = "Jouer",
    ["Начать"] = "Commencer",
    ["Подтверждение"] = "Confirmation",
    ["секунд"] = "sec",
    ["Громкость звуков"] = "Volume des sons",
    ["Загрузка музыки"] = "Téléchargement de musique",
    ["Мод"] = "Mod",
    ["Клавиша"] = "Touche",
    ["Белый список"] = "[Liste blanche]",
    ["Чёрный список"] = "[Liste noire]",
    ["Нужно: "] = "Nécessaire : ",
    ["Неизвестно"] = "Inconnu.",
    ["Создать новый"] = "Créer une nouvelle",
    ["Выбранный плейлист"] = "Playlist sélectionnée",
    ["Название плейлиста..."] = "Nom de la playlist...",
    ["Вы не выбрали даже одной музыки"] = "Vous n'avez sélectionné aucune musique.",
    ["Такое название плейлиста уже есть!"] = "Ce nom de playlist existe déjà !",
    ["Такое название плейлиста недопусимо!"] = "Nom de playlist invalide !",
    ["Вы точно хотите удалить этот плейлист?"] = "Êtes-vous sûr de vouloir supprimer cette playlist ?"
}

--------------------------------------------------------------------------------------------------------------|>
--[+] Spanish :--:--:--:--:--:--:--:--:--:--:--:}>                                                            |>
--------------------------------------------------------------------------------------------------------------|>
l["es"] = { 
    ["Создать"] = "Crear",
    ["Готово"] = "Listo",
    ["Да"] = "Sí",
    ["Нет"] = "No",
    ["Хочу"] = "Quiero",
    ["Настройки"] = "[Ajustes]",
    ["Папка недоступна"] = "Mientras su carpeta DATA esté cerrada, guardar configuraciones",
    ["невозможно"] = "es imposible",
    ["Язык"] = "Idioma",
    ["Тема"] = "Tema",
    ["Изменить"] = "Editar",
    ["Добро пожаловать"] = "Bienvenido",
    ["Играть"] = "Reproducir",
    ["Начать"] = "Comenzar",
    ["Подтверждение"] = "Confirmación",
    ["секунд"] = "seg",
    ["Громкость звуков"] = "Volumen de sonidos",
    ["Загрузка музыки"] = "Descargando música",
    ["Мод"] = "Mod",
    ["Клавиша"] = "Tecla",
    ["Белый список"] = "[Lista blanca]",
    ["Чёрный список"] = "[Lista negra]",
    ["Нужно: "] = "Necesario: ",
    ["Неизвестно"] = "Desconocido.",
    ["Создать новый"] = "Crear nueva",
    ["Выбранный плейлист"] = "Lista de reproducción seleccionada",
    ["Название плейлиста..."] = "Nombre de la lista...",
    ["Вы не выбрали даже одной музыки"] = "No has seleccionado ninguna música.",
    ["Такое название плейлиста уже есть!"] = "¡Este nombre de lista ya existe!",
    ["Такое название плейлиста недопусимо!"] = "¡Nombre de lista no válido!",
    ["Вы точно хотите удалить этот плейлист?"] = "¿Estás seguro de que quieres eliminar esta lista?"
}

-->                      _M_                                                   
-- [*] Кто ты, Воин?    (0-0)                     
-->                      -w-   
--